# MPG Cars

### Introduction:

The following exercise utilizes data from [UC Irvine Machine Learning Repository](https://archive.ics.uci.edu/ml/datasets/Auto+MPG)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the first dataset [cars1](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv) and [cars2](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv).

   ### Step 3. Assign each to a variable called cars1 and cars2

In [2]:
cars1 = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars1.csv', sep=',')
cars2 = pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/05_Merge/Auto_MPG/cars2.csv', sep=',')

### Step 4. Oops, it seems our first dataset has some unnamed blank columns, fix cars1

In [9]:
cars1 = cars1.loc[:, "mpg":"car"]
cars1

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
193,24.0,6,200,81,3012,17.6,76,1,ford maverick
194,22.5,6,232,90,3085,17.6,76,1,amc hornet
195,29.0,4,85,52,2035,22.2,76,1,chevrolet chevette
196,24.5,4,98,60,2164,22.1,76,1,chevrolet woody
197,29.0,4,90,70,1937,14.2,76,2,vw rabbit

### Step 5. What is the number of observations in each dataset?

In [15]:
print(cars1.shape)
print(cars2.shape)

(198, 9)
(200, 9)

### Step 6. Join cars1 and cars2 into a single DataFrame called cars

In [17]:
cars = cars1.append(cars2)
cars

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst
4,17.0,8,302,140,3449,10.5,70,1,ford torino
...,...,...,...,...,...,...,...,...,...
195,27.0,4,140,86,2790,15.6,82,1,ford mustang gl
196,44.0,4,97,52,2130,24.6,82,2,vw pickup
197,32.0,4,135,84,2295,11.6,82,1,dodge rampage
198,28.0,4,120,79,2625,18.6,82,1,ford ranger
199,31.0,4,119,82,2720,19.4,82,1,chevy s-10

### Step 7. Oops, there is a column missing, called owners. Create a random number Series from 15,000 to 73,000.

In [18]:
nr_owners = np.random.randint(15000, high=73001, size=398, dtype='l')
nr_owners

array([51487, 41605, 52243, 16481, 48685, 28866, 34553, 26320, 27731,
       64095, 27865, 27103, 56023, 67530, 65634, 26399, 24629, 55364,
       51086, 50116, 62284, 48251, 48796, 16488, 51877, 28062, 70116,
       26308, 43778, 62980, 66258, 34948, 26863, 17989, 58088, 29639,
       47766, 48655, 42716, 44260, 64934, 27338, 48664, 24616, 28983,
       20100, 56376, 30064, 33719, 64652, 60900, 25512, 53405, 51484,
       56607, 21928, 71692, 45667, 49382, 69265, 56791, 57787, 17748,
       51033, 33608, 52216, 18672, 72766, 66325, 58428, 64153, 72671,
       27199, 21286, 45958, 42265, 49250, 56205, 72995, 65752, 29987,
       27513, 53377, 21144, 20453, 45245, 39862, 34044, 56918, 25345,
       67080, 21483, 45244, 20295, 72636, 56113, 50181, 39676, 41643,
       25666, 16908, 60449, 35672, 23253, 70692, 67167, 38326, 50362,
       64467, 26318, 57294, 34698, 17258, 33938, 17917, 27102, 42325,
       68252, 48333, 30938, 44324, 48904, 22299, 64174, 22032, 32898,
       30593, 47485, 62217, 27557, 37201, 17287, 68814, 57831, 61543,
       48444, 20278, 54848, 66817, 47004, 68080, 39511, 16432, 33210,
       21028, 46724, 51609, 18660, 21666, 45629, 43732, 35574, 31592,
       70872, 23694, 47297, 26549, 58069, 23667, 19866, 33759, 65419,
       45664, 22510, 56338, 32226, 21547, 41728, 59672, 31945, 58303,
       65435, 26738, 54851, 38156, 57994, 22576, 17696, 28071, 57965,
       35751, 44284, 39435, 44660, 56620, 21298, 29376, 71062, 18544,
       18370, 36475, 72510, 19935, 15142, 43594, 66004, 62845, 36141,
       32179, 47965, 72280, 50039, 53348, 63697, 32109, 54550, 50467,
       48211, 35672, 56360, 16976, 35476, 58779, 15157, 16232, 66856,
       22921, 30027, 63903, 39083, 66303, 38300, 56461, 37226, 36435,
       65715, 58508, 71466, 22391, 28287, 46947, 63118, 30693, 64022,
       53900, 36084, 52699, 44497, 37522, 59284, 39590, 15779, 43877,
       17085, 44990, 30727, 23452, 28477, 54634, 67876, 54700, 71477,
       63640, 58106, 63873, 60650, 30496, 69970, 55818, 55495, 16873,
       55094, 26901, 59482, 46979, 22583, 58923, 47988, 27589, 33925,
       45359, 51388, 51482, 33894, 61456, 48848, 19346, 54112, 23270,
       56379, 27270, 42431, 22484, 50150, 25698, 46042, 66051, 58882,
       43088, 54720, 70421, 54364, 70119, 27082, 15126, 40533, 52481,
       49701, 53588, 18614, 30170, 33702, 57498, 40176, 62920, 67061,
       41410, 66934, 35725, 70828, 68003, 28518, 45430, 47722, 41817,
       50640, 30060, 61386, 72872, 65598, 59092, 59173, 72139, 35540,
       52359, 60828, 55930, 47246, 19389, 71433, 30468, 33454, 19527,
       29221, 55616, 67751, 59886, 32949, 37465, 45719, 23171, 72344,
       32608, 16659, 58891, 72862, 15882, 20734, 48595, 46757, 24934,
       17481, 68823, 20553, 31574, 69996, 52359, 48759, 41233, 39237,
       72401, 25149, 25687, 40104, 32876, 55956, 67097, 67085, 40761,
       16743, 54663, 29706, 16522, 69137, 46245, 17400, 49685, 56178,
       23115, 17092, 59266, 21282, 62996, 21636, 27335, 26397, 49792,
       39411, 29058, 68810, 63795, 66384, 63156, 23982, 34292, 57821,
       69956, 39859])

### Step 8. Add the column owners to cars

In [19]:
cars['owners'] = nr_owners
cars.head()

,mpg,cylinders,displacement,horsepower,weight,acceleration,model,origin,car,owners
0,18.0,8,307,130,3504,12.0,70,1,chevrolet chevelle malibu,51487
1,15.0,8,350,165,3693,11.5,70,1,buick skylark 320,41605
2,18.0,8,318,150,3436,11.0,70,1,plymouth satellite,52243
3,16.0,8,304,150,3433,12.0,70,1,amc rebel sst,16481
4,17.0,8,302,140,3449,10.5,70,1,ford torino,48685